IRP/src/Reports/OffsetOfAdvances/OffsetOfAdvances.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>OffsetOfAdvances</name>
</mdclass:Report>

IRP/src/InformationRegisters/T2010S_OffsetOfAdvances/T2010S_OffsetOfAdvances.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>T2010S_OffsetOfAdvances</name>
 <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
 <writeMode>RecorderSubordinate</writeMode>
 <resources>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Document</name>
  <type>
   <types>DocumentRef.SalesReportFromTradeAgent</types>
   <types>DocumentRef.CashPayment</types>
   <types>DocumentRef.PurchaseInvoice</types>
   <types>DocumentRef.DebitNote</types>
   <types>DocumentRef.CreditNote</types>
   <types>DocumentRef.BankReceipt</types>
   <types>DocumentRef.PurchaseReturn</types>
   <types>DocumentRef.DebitCreditNote</types>
   <types>DocumentRef.BankPayment</types>
   <types>DocumentRef.EmployeeCashAdvance</types>
   <types>DocumentRef.ChequeBondTransactionItem</types>
   <types>DocumentRef.CashReceipt</types>
   <types>DocumentRef.OpeningEntry</types>
   <types>DocumentRef.RetailReturnReceipt</types>
   <types>DocumentRef.SalesReturn</types>
   <types>DocumentRef.RetailSalesReceipt</types>
   <types>DocumentRef.SalesReportToConsignor</types>
   <types>DocumentRef.PurchaseOrderClosing</types>
   <types>DocumentRef.SalesOrderClosing</types>
   <types>DocumentRef.SalesInvoice</types>
  </type>
 </dimensions>
 <dimensions>
  <name>RecordType</name>
  <type>
   <types>EnumRef.RecordType</types>
  </type>
 </dimensions>
 <dimensions>
  <name>IsAdvanceRelease</name>
  <type>
   <types>Boolean</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </dimensions>
 <dimensions>
  <name>LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Agreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </dimensions>
 <dimensions>
  <name>TransactionDocument</name>
  <type>
   <types>DocumentRef.SalesReportFromTradeAgent</types>
   <types>DocumentRef.CashTransferOrder</types>
   <types>DocumentRef.PurchaseInvoice</types>
   <types>DocumentRef.DebitNote</types>
   <types>DocumentRef.CreditNote</types>
   <types>DocumentRef.PurchaseReturn</types>
   <types>DocumentRef.OpeningEntry</types>
   <types>DocumentRef.SalesReturn</types>
   <types>DocumentRef.SalesReportToConsignor</types>
   <types>DocumentRef.SalesInvoice</types>
  </type>
 </dimensions>
 <dimensions>
  <name>DELETE_TransactionAgreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </dimensions>
 <dimensions>
  <name>DELETE_AdvanceAgreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </dimensions>
 <dimensions>
  <name>AdvanceOrder</name>
  <type>
   <types>DocumentRef.PurchaseOrder</types>
   <types>DocumentRef.SalesOrder</types>
  </type>
 </dimensions>
 <dimensions>
  <name>TransactionOrder</name>
  <type>
   <types>DocumentRef.PurchaseOrder</types>
   <types>DocumentRef.SalesOrder</types>
  </type>
 </dimensions>
 <dimensions>
  <name>DELETE_FromAdvanceKey</name>
  <type>
   <types>CatalogRef.DELETE_AdvancesKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>DELETE_ToTransactionKey</name>
  <type>
   <types>CatalogRef.DELETE_TransactionsKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>DELETE_FromTransactionKey</name>
  <type>
   <types>CatalogRef.DELETE_TransactionsKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>DELETE_ToAdvanceKey</name>
  <type>
   <types>CatalogRef.DELETE_AdvancesKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>AdvanceProject</name>
  <type>
   <types>CatalogRef.Projects</types>
  </type>
 </dimensions>
 <dimensions>
  <name>TransactionProject</name>
  <type>
   <types>CatalogRef.Projects</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Key</name>
  <type>
   <types>DefinedType.typeRowID</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/AccumulationRegisters/R1020B_AdvancesToVendors/R1020B_AdvancesToVendors.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>R1020B_AdvancesToVendors</name>
  <resources>
    <name>Amount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <attributes>
    <name>DeferredCalculation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorsAdvancesClosing</name>
    <type>
      <types>DocumentRef.VendorsAdvancesClosing</types>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Branch</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CurrencyMovementType</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>LegalName</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Partner</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Basis</name>
    <type>
      <types>DocumentRef.CashPayment</types>
      <types>DocumentRef.DebitNote</types>
      <types>DocumentRef.CreditNote</types>
      <types>DocumentRef.PurchaseReturn</types>
      <types>DocumentRef.BankPayment</types>
      <types>DocumentRef.OpeningEntry</types>
      <types>DocumentRef.SalesReturn</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

IRP/src/AccumulationRegisters/R1021B_VendorsTransactions/R1021B_VendorsTransactions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>R1021B_VendorsTransactions</name>
  <resources>
    <name>Amount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <attributes>
    <name>DeferredCalculation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorsAdvancesClosing</name>
    <type>
      <types>DocumentRef.VendorsAdvancesClosing</types>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Branch</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CurrencyMovementType</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>LegalName</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Partner</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Agreement</name>
    <type>
      <types>CatalogRef.Agreements</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Basis</name>
    <type>
      <types>DefinedType.typeApTransactionBasises</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

IRP/src/Catalogs/Agreements/Agreements.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Agreements</name>
 <attributes>
  <name>Number</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>30</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>Date</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>PartnerSegment</name>
  <type>
   <types>CatalogRef.PartnerSegments</types>
  </type>
 </attributes>
 <attributes>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>PriceType</name>
  <type>
   <types>CatalogRef.PriceTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>ItemSegment</name>
  <type>
   <types>CatalogRef.ItemSegments</types>
  </type>
 </attributes>
 <attributes>
  <name>StartUsing</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>EndOfUse</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>ManagerSegment</name>
  <type>
   <types>CatalogRef.PartnerSegments</types>
  </type>
 </attributes>
 <attributes>
  <name>PriceIncludeTax</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>DaysBeforeDelivery</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>2</precision>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>Store</name>
  <type>
   <types>CatalogRef.Stores</types>
  </type>
 </attributes>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.AgreementTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>CurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </attributes>
 <attributes>
  <name>ApArPostingDetail</name>
  <type>
   <types>EnumRef.ApArPostingDetail</types>
  </type>
 </attributes>
 <attributes>
  <name>StandardAgreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </attributes>
 <attributes>
  <name>Kind</name>
  <type>
   <types>EnumRef.AgreementKinds</types>
  </type>
 </attributes>
 <attributes>
  <name>UseCreditLimit</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>CreditLimitAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </attributes>
 <attributes>
  <name>PaymentTerm</name>
  <type>
   <types>CatalogRef.PaymentSchedules</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentFeeType</name>
  <type>
   <types>EnumRef.TradeAgentFeeTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentFeePercent</name>
  <type>
   <types>DefinedType.typePercent</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentFeeItem</name>
  <type>
   <types>CatalogRef.Items</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentFeeItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentFeeProfitLossCenter</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentFeeExpenseRevenueType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>RecordPurchasePrices</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Account</name>
  <type>
   <types>CatalogRef.PartnersBankAccounts</types>
  </type>
 </attributes>
 <attributes>
  <name>UseOrdersForSettlements</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/ChartsOfCharacteristicTypes/CurrencyMovementType/CurrencyMovementType.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
 <name>CurrencyMovementType</name>
 <type>
  <types>EnumRef.CurrencyType</types>
 </type>
 <predefined>
  <items>
   <name>SettlementCurrency</name>
   <type>
    <types>EnumRef.CurrencyType</types>
   </type>
  </items>
  <items>
   <name>Default_PartnerTerm</name>
   <type>
    <types>EnumRef.CurrencyType</types>
   </type>
  </items>
  <items>
   <name>Default_Legal</name>
   <type>
    <types>EnumRef.CurrencyType</types>
   </type>
  </items>
 </predefined>
 <attributes>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </attributes>
 <attributes>
  <name>Source</name>
  <type>
   <types>CatalogRef.IntegrationSettings</types>
  </type>
 </attributes>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.CurrencyType</types>
  </type>
 </attributes>
 <attributes>
  <name>DeferredCalculation</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>NotPostIfRateNotSet</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>EverydayRates</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
</mdclass:ChartOfCharacteristicTypes>

IRP/src/Reports/OffsetOfAdvances/Forms/ReportForm/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	Period.StartDate = Date(2021,11,22);
	Period.EndDate   = Date(2021,11,22);
EndProcedure

&AtClient
Procedure Run(Command)
	RunAtServer();
EndProcedure

&AtServer
Procedure RunAtServer()
	ThisObject.Doc.Clear();
	Template = Reports.OffsetOfAdvances.GetTemplate("Template");
	Area_Header = Template.GetArea("Header");
	Doc.Put(Area_Header);
	MainTable = GetMainTable();
	For Each MainRow In MainTable Do
		Area_Caption = Template.GetArea("Caption");
		Area_Caption.Parameters.Fill(MainRow);
		Doc.Put(Area_Caption);
		
		DocumentTable = GetDocumentTable(MainRow);
		For Each DocumentRow In DocumentTable Do
			Area_Row = Template.GetArea("Row");
			Area_Row.Parameters.Fill(DocumentRow);
			Area_Row.Parameters.Fill(GetCorrespondent(MainRow, DocumentRow));
			Doc.Put(Area_Row);
		EndDo;
	EndDo;
	
EndProcedure

Function GetCorrespondent(MainRow, DocumentRow)
	Query = New Query();
	Query.Text = 
	"SELECT
	|	CASE
	|		WHEN T2010S_OffsetOfAdvances.Document = T2010S_OffsetOfAdvances.TransactionDocument
	|			THEN T2010S_OffsetOfAdvances.AdvancesDocument
	|		WHEN T2010S_OffsetOfAdvances.Document = T2010S_OffsetOfAdvances.AdvancesDocument
	|			THEN T2010S_OffsetOfAdvances.TransactionDocument
	|	END AS Correspondent,
	|	T2010S_OffsetOfAdvances.LineNumber
	|FROM
	|	InformationRegister.T2010S_OffsetOfAdvances AS T2010S_OffsetOfAdvances
	|WHERE
	|	T2010S_OffsetOfAdvances.Company = &Company
	|	AND T2010S_OffsetOfAdvances.Branch = &Branch
	|	AND T2010S_OffsetOfAdvances.Currency = &Currency
	|	AND T2010S_OffsetOfAdvances.Partner = &Partner
	|	AND T2010S_OffsetOfAdvances.LegalName = &LegalName
	|	AND T2010S_OffsetOfAdvances.Agreement = &Agreement
	|	AND T2010S_OffsetOfAdvances.Document = &Document";
	Query.SetParameter("Company", MainRow.Company);
	Query.SetParameter("Branch", MainRow.Branch);
	Query.SetParameter("Currency", MainRow.Currency);
	Query.SetParameter("LegalName", MainRow.LegalName);
	Query.SetParameter("Partner", MainRow.Partner);
	Query.SetParameter("Agreement", MainRow.Agreement);
	Query.SetParameter("Document", DocumentRow.Document);
	QueryResult = Query.Execute();
	QuerySelection = QueryResult.Select();
	If QuerySelection.Next() Then
		Return QuerySelection;
	EndIf;
	Return New Structure("Correspondent, LineNumber", "---", "");
EndFunction

Function GetDocumentTable(MainRow)
	Query = New Query();
	Query.Text = 
	"SELECT
	|	R1020B_AdvancesToVendorsBalanceAndTurnovers.Recorder AS Recorder,
	|	R1020B_AdvancesToVendorsBalanceAndTurnovers.Recorder.PointInTime AS PointInTime,
	|	R1020B_AdvancesToVendorsBalanceAndTurnovers.AmountOpeningBalance AS AdvanceOpen,
	|	R1020B_AdvancesToVendorsBalanceAndTurnovers.AmountReceipt AS AdvanceReceipt,
	|	R1020B_AdvancesToVendorsBalanceAndTurnovers.AmountExpense AS AdvanceExpense,
	|	R1020B_AdvancesToVendorsBalanceAndTurnovers.AmountClosingBalance AS AdvanceClosing,
	|	0 AS TransactionOpen,
	|	0 AS TransactionReceipt,
	|	0 AS TransactionExpense,
	|	0 AS TransactionClose
	|INTO tmp
	|FROM
	|	AccumulationRegister.R1020B_AdvancesToVendors.BalanceAndTurnovers(BEGINOFPERIOD(&BeginOfPeriod, DAY),
	|		ENDOFPERIOD(&EndOfPeriod, DAY), Recorder, RegisterRecords, Company = &Company
	|	AND Branch = &Branch
	|	AND Currency = &Currency
	|	AND LegalName = &LegalName
	|	AND Partner = &Partner
	|	AND CurrencyMovementType = VALUE(ChartOfCharacteristicTypes.CurrencyMovementType.SettlementCurrency)) AS
	|		R1020B_AdvancesToVendorsBalanceAndTurnovers
	|
	|UNION ALL
	|
	|SELECT
	|	R1021B_VendorsTransactionsBalanceAndTurnovers.Recorder,
	|	R1021B_VendorsTransactionsBalanceAndTurnovers.Recorder.PointInTime,
	|	0,
	|	0,
	|	0,
	|	0,
	|	R1021B_VendorsTransactionsBalanceAndTurnovers.AmountOpeningBalance,
	|	R1021B_VendorsTransactionsBalanceAndTurnovers.AmountReceipt,
	|	R1021B_VendorsTransactionsBalanceAndTurnovers.AmountExpense,
	|	R1021B_VendorsTransactionsBalanceAndTurnovers.AmountClosingBalance
	|FROM
	|	AccumulationRegister.R1021B_VendorsTransactions.BalanceAndTurnovers(BEGINOFPERIOD(&BeginOfPeriod, DAY),
	|		ENDOFPERIOD(&EndOfPeriod, DAY), Recorder, RegisterRecords, Company = &Company
	|	AND Branch = &Branch
	|	AND Currency = &Currency
	|	AND LegalName = &LegalName
	|	AND Partner = &Partner
	|	AND Agreement = &Agreement
	|	AND CurrencyMovementType = VALUE(ChartOfCharacteristicTypes.CurrencyMovementType.SettlementCurrency)) AS
	|		R1021B_VendorsTransactionsBalanceAndTurnovers
	|;
	|
	|
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	tmp.Recorder AS Document,
	|	SUM(tmp.AdvanceOpen) AS AdvanceOpen,
	|	SUM(tmp.AdvanceReceipt) AS AdvanceReceipt,
	|	SUM(tmp.AdvanceExpense) AS AdvanceExpense,
	|	SUM(tmp.AdvanceClosing) AS AdvanceClosing,
	|	SUM(tmp.TransactionOpen) AS TransactionOpen,
	|	SUM(tmp.TransactionReceipt) AS TransactionReceipt,
	|	SUM(tmp.TransactionExpense) AS TransactionExpense,
	|	SUM(tmp.TransactionClose) AS TransactionClose
	|FROM
	|	tmp AS tmp
	|GROUP BY
	|	tmp.Recorder,
	|	tmp.PointInTime
	|ORDER BY
	|	tmp.PointInTime";
	Query.SetParameter("BeginOfPeriod", Period.StartDate);
	Query.SetParameter("EndOfPeriod", Period.EndDate);
	Query.SetParameter("Company", MainRow.Company);
	Query.SetParameter("Branch", MainRow.Branch);
	Query.SetParameter("Currency", MainRow.Currency);
	Query.SetParameter("LegalName", MainRow.LegalName);
	Query.SetParameter("Partner", MainRow.Partner);
	Query.SetParameter("Agreement", MainRow.Agreement);
	QueryResult = Query.Execute();
	QueryTable = QueryResult.Unload();
	Return QueryTable;
	
EndFunction

Function GetMainTable()
	Query = New Query();
	Query.Text = 
	"SELECT
	|	R1020B_AdvancesToVendors.Company,
	|	R1020B_AdvancesToVendors.Branch,
	|	R1020B_AdvancesToVendors.Partner,
	|	R1020B_AdvancesToVendors.LegalName,
	|	R1020B_AdvancesToVendors.Currency,
	|	VALUE(Catalog.Agreements.EmptyRef) AS Agreement,
	|	R1020B_AdvancesToVendors.Basis
	|INTO tmp
	|FROM
	|	AccumulationRegister.R1020B_AdvancesToVendors AS R1020B_AdvancesToVendors
	|WHERE
	|	R1020B_AdvancesToVendors.Period BETWEEN BEGINOFPERIOD(&BeginOfPeriod, day) AND ENDOFPERIOD(&EndOfPeriod, day)
	|	AND
	|		R1020B_AdvancesToVendors.CurrencyMovementType = VALUE(ChartOfCharacteristicTypes.CurrencyMovementType.SettlementCurrency)
	|
	|UNION ALL
	|
	|SELECT
	|	R1021B_VendorsTransactions.Company,
	|	R1021B_VendorsTransactions.Branch,
	|	R1021B_VendorsTransactions.Partner,
	|	R1021B_VendorsTransactions.LegalName,
	|	R1021B_VendorsTransactions.Currency,
	|	R1021B_VendorsTransactions.Agreement,
	|	R1021B_VendorsTransactions.Basis
	|FROM
	|	AccumulationRegister.R1021B_VendorsTransactions AS R1021B_VendorsTransactions
	|WHERE
	|	R1021B_VendorsTransactions.Period BETWEEN BEGINOFPERIOD(&BeginOfPeriod, day) AND ENDOFPERIOD(&EndOfPeriod, day)
	|	AND
	|		R1021B_VendorsTransactions.CurrencyMovementType = VALUE(ChartOfCharacteristicTypes.CurrencyMovementType.SettlementCurrency)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	tmp.Company,
	|	tmp.Branch,
	|	tmp.Partner,
	|	tmp.LegalName,
	|	tmp.Currency,
	|	max(tmp.Agreement) as Agreement
	//|	tmp.Basis
	|FROM
	|	tmp AS tmp
	|GROUP BY
	|	
	//|	tmp.Basis,
	|	tmp.Branch,
	|	tmp.Company,
	|	tmp.Currency,
	|	tmp.LegalName,
	|	tmp.Partner";
	Query.SetParameter("BeginOfPeriod", Period.StartDate);
	Query.SetParameter("EndOfPeriod", Period.EndDate);
	QueryResult = Query.Execute();
	QueryTable = QueryResult.Unload();
	Return QueryTable;
EndFunction
